{"class_name": "Sequential", "keras_version": "2.1.3", "config": [{"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "embedding_1", "dtype": "float32", "output_dim": 200, "trainable": true, "embeddings_regularizer": null, "input_dim": 27317, "mask_zero": true, "embeddings_constraint": null, "batch_input_shape": [null, null], "activity_regularizer": null, "input_length": null}}, {"class_name": "Bidirectional", "config": {"merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 100, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "lstm_1", "bias_constraint": null, "go_backwards": false, "implementation": 1, "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null}}, "trainable": true, "name": "bidirectional_1"}}, {"class_name": "CRF", "config": {"trainable": true, "use_bias": true, "chain_regularizer": null, "bias_regularizer": null, "boundary_constraint": null, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 18, "use_boundary": true, "test_mode": "viterbi", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "boundary_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "boundary_regularizer": null, "name": "crf_1", "learn_mode": "join", "bias_constraint": null, "chain_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_regularizer": null, "input_dim": 200, "chain_constraint": null, "sparse_target": true}}], "backend": "tensorflow"}